[
  {
    "name": "Sapphire",
    "file": "Sapphire_cropped",
    "date": [2023, 3, 3],
    "info": "My first ever digital piece that I completed in the middle of a robotics competition at Hueneme Port Regional in 2023. I was still getting used to Procreate and the round brush."
  },
  {
    "name": "Flowers",
    "file": "Flowers(1)",
    "date": [2023, 3, 7],
    "info": "My second piece that I didn't spend a lot of time on. It was originally derived from a pencil sketch."
  },
  {
    "name": "Samurai",
    "file": "Samurai",
    "date": [2023, 3, 9],
    "info": "A random piece that I wanted to complete. Looked better in my head than on the tablet. Here's one of the first times I tried to draw gold, or any metal, ever."
  },
  {
    "name": "Angel",
    "file": "Angel_cropped",
    "date": [2023, 3, 13],
    "info": "One of the first pieces I tried back-lighting on, but my main focus while drawing this was the background, not the character. I really liked the scenery, but I didn't know how to draw clothing at the time."
  },
  {
    "name": "Dragon",
    "file": "Dragon_cropped(1)",
    "date": [2023, 3, 21],
    "info": "This was actually one of my most hated artworks. This was the tipping point for me to start actually studying digital. I had gathered up a bunch of artists that I enjoyed, so I studied them for a while."
  },
  {
    "name": "Sailor",
    "file": "Sailor_cropped",
    "date": [2023, 4, 1],
    "info": "This was the first artwork after my studies. I can say, it looks much different, and better, than the previous piece. First time I finally realized core shadow was important. I also switched over to a blockier look."
  },
  {
    "name": "Machine",
    "file": "Machine_cropped",
    "date": [2023, 4, 14],
    "info": "I always wanted to do something mechanical instead of fantastical. Here was my attempt at that. I still didn't know how to draw metal, so nothing looks shiny – just plain rough steel. But the lighting was nice."
  },
  {
    "name": "Dragon",
    "file": "Dragon_cropped(2)",
    "date": [2023, 4, 28],
    "info": "This piece took way too long to complete, with me working on it daily. This was where I encountered the problem of layers. I was using so many to the point I had to duplicate the piece, and collapse some layers in one of the copies to prevent permanently deleting layers. This was also when I actually studied how to draw metal."
  },
  {
    "name": "Reaper",
    "file": "Reaper",
    "date": [2023, 5, 10],
    "info": "Sadly, this was one of the pieces I hated the most as well. It looked much better in my head than on the tablet. I'm not sure why."
  },
  {
    "name": "Puppet",
    "file": "Puppet",
    "date": [2023, 5, 20],
    "info": "I enjoyed making this piece. There are quite a few things I would've changed, but overall I enjoyed how it turned out. It was a more abstract piece with less actual rendering and more stylistic coloring, using shades that don't typically appear."
  },
  {
    "name": "Jelly",
    "file": "Jelly",
    "date": [2023, 5, 30],
    "info": "This is one of my favorite pieces, despite being made a while ago. I enjoyed the color palette, and the semi-transparent jellyfish was nearly perfect. The backlight was also very nice. The only issue I had was with the clothing and pose."
  },
  {
    "name": "Conductor",
    "file": "Conductor",
    "date": [2023, 6, 15],
    "info": "I drew this after a trip to Japan (hence the JR logo). I saw that some train stations had mascots and wanted to create my own. I sketched the original idea for this while riding the train actually."
  },
  {
    "name": "Demon",
    "file": "Demon(1)",
    "date": [2023, 6, 23],
    "info": "Created this after looking at a bunch of AI pieces. I really wanted to create something similar, so I tried. It turned out alright in my book, but could've been much better. The lighting is all over the place..."
  },
  {
    "name": "Angel",
    "file": "Angel",
    "date": [2023, 7, 21],
    "info": "The second angel piece I have here! Was pretty detailed, but the metal was shabby in my opinion. After this, I decided I wanted to adopt a more paint-like style, instead of this smoothened out style."
  },
  {
    "name": "Flowers",
    "file": "Flowers(2)",
    "date": [2023, 7, 31],
    "info": "My first time experimenting with a new brush I made, that forces me to use blocky shapes. I really really enjoyed the block style, so I kept it. This piece was inspired by AI."
  },
  {
    "name": "Miku",
    "file": "Miku",
    "date": [2023, 8, 7],
    "info": "Drew this for a friend, though I never showed them. They were obsessed with Miku, and I wanted to practice some more. My first ever drawing of any existing character instead of something I made up."
  },
  {
    "name": "Pirate",
    "file": "Pirate",
    "date": [2023, 8, 18],
    "info": "This was originally created as a redraw of the Sailor piece. I'd like to think it turned out better. It's colors are more extreme, but again, I seemed to have forgotten how to draw metal again."
  },
  {
    "name": "Demon",
    "file": "Demon(2)",
    "date": [2023, 12, 17],
    "info": "This was drawn after a long long break (2 months) where I was extremely busy. I think it turned out surprisingly well given I basically drew nothing digitally during this time period. The metal armor turned out nice."
  },
  {
    "name": "2024",
    "file": "2024",
    "date": [2023, 12, 31],
    "info": "A very rushed piece as I was running out of time. Drew this on the Carnival cruise ship to Mexico during winter break. Personally, I think it turned out suboptimal, but it is a piece nonetheless."
  },
  {
    "name": "Discord",
    "file": "Discord",
    "date": [2024, 1, 7],
    "info": "A random piece that I did for some friends on Discord. Overall, unremarkable, but I really liked the metal rendering on the knee and hands."
  },
  {
    "name": "Justice",
    "file": "Justice",
    "date": [2024, 2, 3],
    "info": "Another hated piece. It looked much better in my head, but on the tablet it looks terrible, personally. This was my last piece before another long break as I got busy again."
  },
  {
    "name": "Dragon Tamer",
    "file": "Dragon_Tamer",
    "date": [2024, 4, 27],
    "info": "Finally drew something after another 2 month break. It turned out decently, and the style of person suddenly changed to more realistic after the break. Dragon's body is based off of Toothless!"
  },
  {
    "name": "Smoke",
    "file": "Smoke",
    "date": [2024, 5, 4],
    "info": "Went through multiple drafts, and this was the one I settled on. I could not figure out a good lighting scheme and background, and it turned out alright. The fire was fun to draw, though."
  },
  {
    "name": "Be Your Army",
    "file": "Be_Your_Army",
    "date": [2024, 5, 18],
    "info": "Started out as a cool sketch that I turned digital. The helmet turned out nice, but the face and body was rushed. The overall theme and background was cool though. It took me a while to get that oil-spill effect."
  },
  {
    "name": "Blob King",
    "file": "Blob_King",
    "date": [2024, 6, 13],
    "info": "My profile picture! I had a few cool reference photos for this piece and the semi-transparent jelly feel turned out really nice. The foreground and background were rushed though."
  },
  {
    "name": "Airship Lore",
    "file": "Airship_Lore",
    "date": [2024, 8, 6],
    "info": "Wanted to try a more landscape-ish drawing after another break. So, I created this. Lighting and clothing wise, turned out really nice, but I forgot the reflection in the glass. First time drawing clouds and sky."
  },
  {
    "name": "Death and Fate",
    "file": "Death_And_Fate",
    "date": [2024, 8, 31],
    "info": "Saw a cool drawing online. Did a study of it. I forgot the artist's name. Tried to use more saturated colors and complementary color pairs to emphasize light and dark. Turned out alright."
  },
  {
    "name": "Halloween (2024)",
    "file": "Halloween",
    "date": [2024, 10, 7],
    "info": "Wanted to expand more on the line art and sketch focus of the previous piece. So, this piece is much more sketching and dirty. The shapes didn't turn out as clearly as I had hoped. The metal, ghost, and candles turned out nicely though."
  },
  {
    "name": "Sketch1",
    "file": "Sketch1",
    "date": [2024, 12, 27],
    "info": "After a long break due to increased work from robotics, I barely squeezed out this simplistic drawing. I do not know why I chose this style, but it resonated with me."
  },
  {
    "name": "Sketch2 (aka 2025)",
    "file": "Sketch2",
    "date": [2025, 1, 1],
    "info": "I liked the style from before. I stuck with it for this Chinese zodiac animal art piece, a tradition I continued from the dragin in 2024."
  },
  {
    "name": "Sketch3",
    "file": "Sketch3",
    "date": [2025, 4, 11],
    "info": "My third piece in this super block style. I really enjoyed this informal sketch, evident by the naming. I started treating each piece as just a short, insignificant practice, and I think that was more fun overall. Robotics took a lot of my time."
  },
  {
    "name": "Sketch4",
    "file": "Sketch4",
    "date": [2025, 4, 12],
    "info": "A much more rushed piece. I don't like this one as much, despite the cooler looking character."
  },
  {
    "name": "Sketch5",
    "file": "Sketch5",
    "date": [2025, 12, 20],
    "info": "I hadn't picked up the digital pen in ages, and was unsure of my skills. I sketched this out on paper first, before redrawing it digitally once I was sure it looked fine. Turned out not as bad as I thought."
  }
]
