[
  {
    "name": "Tiananmen Square",
    "file": "Tiananmen_Square",
    "date": [2012, null, null],
    "info": "This was one of my earliest trips to China, where all I had was marker and paper. I recall learning this style of art at my old art class, Yunhua Fang Art Studio."
  },
  {
    "name": "Train",
    "file": "Train",
    "date": [2013, null, null],
    "info": "I vividly recall my dad helping me out with this one, looking up images of trains online. I remember I was baffled by the 3D shape of the train's visor."
  },
  {
    "name": "Horse",
    "file": "Horse",
    "date": [2014, null, null],
    "info": "My art teacher loved having us create pieces for the Chinese zodiac year. 2014 was the year of the horse."
  },
  {
    "name": "Hot",
    "file": "Hot",
    "date": [2015, null, null],
    "info": "It was fall and it was hot! My art teacher, annually, had us try to express the feeling of heat through art in some way. Here's my first attempt!"
  },
  {
    "name": "Turkey",
    "file": "Turkey",
    "date": [2015, null, null],
    "info": "My art class had an annual tradition of drawing turkeys too, since they have lots of layers, colors, and detail. Here's my rendition in marker."
  },
  {
    "name": "Free To Be You And Me",
    "file": "Free_To_Be_You_And_Me",
    "date": [2016, null, null],
    "info": "I created this piece for a local play that happened to host a poster contest, and I won! The play is called: \"Free To Be You And Me.\" I never ended up seeing the play."
  },
  {
    "name": "Don't Wait, Check the Date!",
    "file": "Dont_Wait_Check_the_Date",
    "date": [2016, null, null],
    "info": "This piece was for an art contest for the Palo Alto fire department. My first attempts at drawing people!"
  },
  {
    "name": "Bee",
    "file": "Bee",
    "date": [2016, null, null],
    "info": "I used to be obsessed with bugs. Ladybugs, butterflies, roly-polys (or pillbugs). Here's me nerding out about the different parts of a bee."
  },
  {
    "name": "Motorcycle",
    "file": "Motorcycle",
    "date": [2016, null, null],
    "info": "I vividly remember drawing this piece, and absolutely loving it. I spent so much time drawing on the tires that the paper eventually wrinkled and cracked."
  },
  {
    "name": "Shellophoid",
    "file": "Shellophoid",
    "date": [2016, null, null],
    "info": "An after-school program I participated in only let you draw on Fridays, and only on eight-printer-paper slices. I would make up creatures, almost like Pokemon cards."
  },
  {
    "name": "Mom's Day",
    "file": "Moms_Day",
    "date": [2017, null, null],
    "info": "I drew this for my mom for Mother's day, under the guidance of an art teacher. I managed to accurately depict muscles, neurons, and ex-vivo fertilization for some reason..."
  },
  {
    "name": "Paint Bottle",
    "file": "Paint_Bottle",
    "date": [2017, null, null],
    "info": "I don't even remember drawing this out of marker. It's a surprisingly realistic paint bottle my art teacher had lying around."
  },
  {
    "name": "Rooster",
    "file": "Rooster",
    "date": [2017, null, null],
    "info": "Another Chinese zodiac piece, this time for 2017, the year of the rooster. It was meant to look almost like the Chinese paper cutouts people traditionally made."
  },
  {
    "name": "Warning",
    "file": "Warning",
    "date": [2017, null, null],
    "info": "My art teacher had a phase where he really loved designing warning signs. So, we followed along. Here's some of mine!"
  },
  {
    "name": "Ice Cream",
    "file": "Ice_Cream",
    "date": [2017, null, null],
    "info": "One of those eighth-A4-paper sheets at my local after-school program. I kept doodling weekly, taking nearly all of their stock. It didn't matter, since I was the only one drawing anyways."
  },
  {
    "name": "Doodle for Google",
    "file": "Doodle_for_Google",
    "date": [2017, null, null],
    "info": "An art piece for Google's \"Doodle for Google\" art contest. I have a couple other types too, like one about DNA, and another one about poverty. Here we have bacteria and antibiotics."
  },
  {
    "name": "Looking for Peace",
    "file": "Looking_for_Peace",
    "date": [2018, null, null],
    "info": "A creative work that I did. We frequently did war/peace-related works at my old art studio. I like the wings on this one."
  },
  {
    "name": "Muscle",
    "file": "Muscle",
    "date": [2018, null, null],
    "info": "An abstract piece I did for a 2D design course. The art teacher loved it a lot more than I thought necessary, given all I did was draw a wood/muscle looking thing. But the design isn't bad, looking back."
  },
  {
    "name": "Flowers",
    "file": "Flowers",
    "date": [2018, null, null],
    "info": "We drew flowers and plants often in my old art studio. Here's one of them. I have tons of plants, leaves, flowers, anything green and living."
  },
  {
    "name": "Bamboo",
    "file": "Bamboo",
    "date": [2018, null, null],
    "info": "I tried out Chinese ink watercolor drawings under the guidance of another art teacher, not the one I've been with for about 7 years now. It was fun, but not my type, requiring too much patience."
  },
  {
    "name": "Sketches (1)",
    "file": "Sketches_1",
    "date": [2018, null, null],
    "info": "One of my first times drawing not just other people/things, but other people/things very very quickly. My art teacher hosted a fun \"draw whoever's around you\" activity, so you can see others also sketching away."
  },
  {
    "name": "Perspective",
    "file": "Perspective",
    "date": [2018, null, null],
    "info": "First time practicing perspective. I had a lot of fun deciding what to put in rooms, drawing ladders up/down floors, even creating an elevator."
  },
  {
    "name": "Cranes",
    "file": "Cranes",
    "date": [2019, null, null],
    "info": "A piece I created for a family friend, kind of under the instruction of my parents, because they were getting old. This symbolizes longevity, if I recall correctly."
  },
  {
    "name": "Jar",
    "file": "Jar",
    "date": [2019, null, null],
    "info": "My first time working with acrylic on paper. It didn't turn out too bad!"
  },
  {
    "name": "Transcontinental Railroad",
    "file": "Transcontinental_Railroad",
    "date": [2019, null, null],
    "info": "There was this huge contest locally, celebrating Chinese Americans for being descendants of those who worked on the transcontinental railroad, among being just a celebration of immigrants. Here was my submission."
  },
  {
    "name": "First Landscape",
    "file": "First_Landscape",
    "date": [2019, null, null],
    "info": "My first time using acrylic on canvas, copying off a template piece. This was one of the first times I was at a new art studio, a much smaller one that focused more on technique."
  },
  {
    "name": "Pig",
    "file": "Pig",
    "date": [2019, null, null],
    "info": "Another Chinese zodiac piece, this time for 2019, the year of the pig. I was born in 2007, also the year of the pig. So I am exactly 12."
  },
  {
    "name": "Volcano",
    "file": "Volcano",
    "date": [2019, null, null],
    "info": "I remember thinking this piece was so cool when I drew it."
  },
  {
    "name": "Tiger",
    "file": "Tiger",
    "date": [2019, null, null],
    "info": "My art teacher became obsessed with tigers. We drew nothing but tigers for almost a month. On the bright side, I got really good."
  },
  {
    "name": "Summer Palace",
    "file": "Summer_Palace",
    "date": [2019, null, null],
    "info": "Sketches of the Summer Palace in China, on old, yellowing paper, with a dried out sharpie carried in a rusty metal tin I brought everywhere."
  },
  {
    "name": "Peace",
    "file": "Peace",
    "date": [2020, null, null],
    "info": "A piece I did for a UN contest. I never did win, but the teacher was proud of my work."
  },
  {
    "name": "Wolf",
    "file": "Wolf",
    "date": [2020, 4, 5],
    "info": "One of 5 pieces I did of the same wolf, instructed by my art teacher. The others are all in different mediums: charcoal, marker, oil pastel, and pencil. This is colored pencil."
  },
  {
    "name": "Ox",
    "file": "Ox",
    "date": [2021, null, null],
    "info": "Ah yes, another Chinese zodiac piece. 2021, the year of the ox."
  },
  {
    "name": "COVID",
    "file": "COVID",
    "date": [2021, null, null],
    "info": "Inevitably, with circumstance comes art. Reflecting the pandemic at the time, I drew this piece."
  },
  {
    "name": "Mandela",
    "file": "Mandela",
    "date": [2021, null, null],
    "info": "I do not remember why I drew this. All I recall is that it was difficult to maintain symmetry."
  },
  {
    "name": "Tiger",
    "file": "Tiger_2",
    "date": [2022, null, null],
    "info": "Wow! Look! Another Chinese zodiac piece! 2022, the year of the tiger. Also the same zodiac my brother was born in; he's now 12."
  },
  {
    "name": "Eye",
    "file": "Eye",
    "date": [2022, null, null],
    "info": "I started going to this third art studio all the way in Foster City. This was a heavily technical art studio, so I instantly started back at the fundamentals, which I never mastered."
  },
  {
    "name": "Second Landscape",
    "file": "Second_Landscape",
    "date": [2022, null, null],
    "info": "My first acrylic piece at the new art studio, copying off of a template piece. It is an improvement."
  },
  {
    "name": "Sketches (2)",
    "file": "Sketches_2",
    "date": [2022, null, null],
    "info": "Even more sketches done at my first art studio. Definitely got better at drawing people, but they still looked cartoony, with no anatomy."
  },
  {
    "name": "Still Life (1)",
    "file": "Still_Life_1",
    "date": [2022, null, null],
    "info": "Back at the new art studio, I learned a lot more pencil technique. Here's a copy of another piece."
  },
  {
    "name": "Person (1)",
    "file": "Person_1",
    "date": [2022, null, null],
    "info": "At the new art studio, I was learning a lot more about how to draw what I saw before me. Here was a copy of a color HD photo."
  },
  {
    "name": "Person (2)",
    "file": "Person_2",
    "date": [2023, null, null],
    "info": "I drew another person. This time, I decided to spice it up, adding some more things on top. I later digitally recolored this whole piece."
  },
  {
    "name": "Person (3) / A Masked Reset",
    "file": "Person_3",
    "date": [2023, null, null],
    "info": "I drew yet another person. Again, I decided to add stuff on top, reflecting the waning pandemic. Turned out pretty cool."
  },
  {
    "name": "Still Life (2)",
    "file": "Still_Life_2",
    "date": [2023, null, null],
    "info": "A still life piece done with acrylic on canvas, over the course of a couple weeks. Turned out pretty good."
  },
  {
    "name": "Person (4)",
    "file": "Person_4",
    "date": [2023, null, null],
    "info": "I drew yet another person, this time in acrylic. I needed some help from the art teacher at the new studio."
  },
  {
    "name": "Veteran",
    "file": "Veteran",
    "date": [2023, null, null],
    "info": "A piece to commemorate veterans, after the recent full-scale invasion of Ukraine by Russia, along with an overall sense of tension in the world."
  },
  {
    "name": "A Silent Man",
    "file": "A_Silent_Man",
    "date": [2024, null, null],
    "info": "A piece I made, totally independently. All I used as reference were pictures of keys and locks."
  },
  {
    "name": "Open Minded",
    "file": "Open_Minded",
    "date": [2024, null, null],
    "info": "A piece I made, based on some source material, but heavily modified to have a totally different meaning. Kaboom!"
  },
  {
    "name": "A Curious Man",
    "file": "A_Curious_Man",
    "date": [2024, null, null],
    "info": "A piece I made, totally independently, free from any source material, other than Googling certain planets, outer space, or skulls and hands and apples."
  },
  {
    "name": "A Cellular Crisis",
    "file": "A_Cellular_Crisis",
    "date": [2024, null, null],
    "info": "An acrylic-on-canvas piece done purely creatively out of my imagination. Reflects the late nights my mom spent yelling on her phone. The blue was added afterward, digitally."
  },
  {
    "name": "A Silent Man (color)",
    "file": "A_Silent_Man_color",
    "date": [2025, null, null],
    "info": "A colorized version of \"A Silent Man.\""
  },
  {
    "name": "Open Minded (color)",
    "file": "Open_Minded_color",
    "date": [2025, null, null],
    "info": "A colorized version of \"Open Minded.\""
  },
  {
    "name": "A Curious Man (color)",
    "file": "A_Curious_Man_color",
    "date": [2025, null, null],
    "info": "A colorized version of \"A Curious Man.\""
  },
  {
    "name": "A Masked Reset (color)",
    "file": "A_Masked_Reset_color",
    "date": [2025, null, null],
    "info": "A colorized version of \"Person (3) / A Masked Reset.\""
  }
]
